In [1]:
import pandas as pd

In [26]:
dictionary = {'Name':['Neha','Krish','Ron','Jacob','Maria','Scarlet'],
              'Occupation':['Software Developer','DevOps Engineer','Data Scientist','ML Engineer','Tester','Agile Coach']}

In [27]:
#Creating DataFrames
Df = pd.DataFrame(dictionary)

In [28]:
Df.head() # first 5 rows of Data frame

    Name          Occupation
0   Neha  Software Developer
1  Krish     DevOps Engineer
2    Ron      Data Scientist
3  Jacob         ML Engineer
4  Maria              Tester

In [31]:
Df.count()

Name          6
Occupation    6
dtype: int64

In [60]:
# Displaying the data frame values, by default only first 5 rows is displayed if no parameter is passed to head
Df.head(10)

      Name          Occupation
0     Neha  Software Developer
1    Krish     DevOps Engineer
2      Ron      Data Scientist
3    Jacob         ML Engineer
4    Maria              Tester
5  Scarlet         Agile Coach

In [33]:
# Create new dataframe from existing data frame

df_new = Df[['Name']]

In [35]:
df_new.head(10)

      Name
0     Neha
1    Krish
2      Ron
3    Jacob
4    Maria
5  Scarlet

In [36]:
df_new_1 = Df[['Name','Occupation']]

In [37]:
df_new_1.head(10)

      Name          Occupation
0     Neha  Software Developer
1    Krish     DevOps Engineer
2      Ron      Data Scientist
3    Jacob         ML Engineer
4    Maria              Tester
5  Scarlet         Agile Coach

In [42]:
Df.head()

    Name          Occupation
0   Neha  Software Developer
1  Krish     DevOps Engineer
2    Ron      Data Scientist
3  Jacob         ML Engineer
4  Maria              Tester

In [47]:
# Access unique elements with iloc

Df.iloc[4,0] #[row index,column index]

'Maria'

In [49]:
#Another way with loc

Df.loc[0,'Name']

'Neha'

In [50]:
Df.loc['Name',1]

KeyError: 1

In [51]:
df_new.head(10)

      Name
0     Neha
1    Krish
2      Ron
3    Jacob
4    Maria
5  Scarlet

In [55]:
df_new.index=['a','b','c','d','e','f'] #Throws error in case more index is set than actual data

In [56]:
df_new.head(10)

      Name
a     Neha
b    Krish
c      Ron
d    Jacob
e    Maria
f  Scarlet

In [57]:
df_new.loc['b','Name']

'Krish'

In [58]:
df_new.loc[1,'Name']

KeyError: 1

In [59]:
df_new.iloc[0,0]

'Neha'

In [74]:
# slice Data frames with iloc

df_slice = Df.iloc[0:2,0:1]

In [75]:
df_slice.head()

    Name
0   Neha
1  Krish

In [76]:
# slice Data frames with loc

df_slice = Df.loc[0:1,'Name':'Occupation']

In [77]:
df_slice.head()

    Name          Occupation
0   Neha  Software Developer
1  Krish     DevOps Engineer

In [84]:
import pandas as pd

list1 = [['Name','Occupation'],['Neha','Software Developer']]

df = pd.DataFrame(list1)

In [85]:
df.head()

      0                   1
0  Name          Occupation
1  Neha  Software Developer

In [86]:
list2 = [['Name','Occupation'],['Neha','Software Developer','Service Company']]

In [88]:
df1 = pd.DataFrame(list2)

In [89]:
df1.head()

      0                   1                2
0  Name          Occupation             None
1  Neha  Software Developer  Service Company

# DataFrame Operations

In [90]:
dictReleased = {'Released':[1982,1980,1973,1992,1977,1976,1977,1977]}

In [91]:
dfReleased = pd.DataFrame(dictReleased)

In [93]:
dfReleased.head(10)

   Released
0      1982
1      1980
2      1973
3      1992
4      1977
5      1976
6      1977
7      1977

In [97]:
dfReleased['Released'].unique()

array([1982, 1980, 1973, 1992, 1977, 1976])

In [98]:
dfReleased['Released'] > 1979

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: Released, dtype: bool

In [99]:
df1 = dfReleased[dfReleased['Released'] > 1979]

In [100]:
df1.head()

   Released
0      1982
1      1980
3      1992

In [101]:
dictAlbum = {'Album':['AA','AB','AC','AD','AE','AF','AG','AH']
             ,'Released':[1982,1980,1973,1992,1977,1976,1977,1977]}

In [102]:
dfAlbum = pd.DataFrame(dictAlbum)

In [103]:
dfAlbum.head(10)

  Album  Released
0    AA      1982
1    AB      1980
2    AC      1973
3    AD      1992
4    AE      1977
5    AF      1976
6    AG      1977
7    AH      1977

In [108]:
df_1979 = dfAlbum[dfAlbum['Released'] > 1979]

In [109]:
df_1979.head(10)

  Album  Released
0    AA      1982
1    AB      1980
3    AD      1992

# Series

In [171]:
# Create a Series from a list

data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [172]:
# Accessing by label

print(s[2])

30

In [173]:
# Accessing by position

print(s.iloc[3])

40

In [174]:
# Accessing multiple elements

print(s[1:4])

1    20
2    30
3    40
dtype: int64

In [175]:
# Returns the Series data as a NumPy array

print(s.values)

[10 20 30 40 50]

In [176]:
# Returns a tuple representing the dimensions of the Series

s.shape

(5,)

In [177]:
# Returns the number of elements in the Series

s.size

5

In [178]:
# Returns the index (labels) of the Series

s.index

RangeIndex(start=0, stop=5, step=1)

In [179]:
# Calculate summary statistics of the data

s.mean()

30.0

In [180]:
s.sum()

150

In [181]:
s.min()

10

In [182]:
s.max()

50

In [183]:
# Get unique values or the number of unique values

s.unique()

array([10, 20, 30, 40, 50])

In [184]:
s.nunique()

5

In [230]:
# Sort the Series by values or index labels

s.sort_values()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [231]:
s.sort_values(ascending=False) # Descending order

4    50
3    40
2    30
1    20
0    10
dtype: int64

In [186]:
s.sort_index()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [232]:
s.sort_index(ascending = False) # Descending Order

4    50
3    40
2    30
1    20
0    10
dtype: int64

In [187]:
# Check for missing (NaN) or non-missing values

s.isnull()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [188]:
s.notnull()

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [189]:
#Apply a custom function to each element of the Series

s.apply(lambda x: x *10)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [190]:
def test_func(x):
    return x*10

s.apply(test_func)

0    100
1    200
2    300
3    400
4    500
dtype: int64

# Data Frames

In [21]:
# Creating DataFrames from Dictionaries:

import pandas as pd
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [22]:
# Columns selection

print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [23]:
# Accessing rows by position

df.iloc[2]

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [20]:
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [25]:
type(df[['Age']])

pandas.core.frame.DataFrame

In [26]:
type(df['Age'])

pandas.core.series.Series

In [195]:
# Accessing rows by label

print(df.loc[1])

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [196]:
# Slicing specific columns

df[['Name','Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [197]:
# Slicing specific columns

df[1:3]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [199]:
# Finding unique elements

print(df['Age'].unique())

[25 30 35 28]

In [200]:
# Conditional Filtering

df[df['Age'] > 25]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [204]:
# Returns the dimensions (number of rows and columns) of the DataFrame

df.shape

(4, 3)

In [205]:
# Provides a summary of the DataFrame, including data types and non-null counts

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [206]:
# Generates summary statistics for numerical columns

df.describe()

             Age
count   4.000000
mean   29.500000
std     4.203173
min    25.000000
25%    27.250000
50%    29.000000
75%    31.250000
max    35.000000

In [207]:
# Displays the first or last n rows of the DataFrame

df.head()

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [208]:
df.tail()

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [212]:
# Calculate summary statistics for numeric columns, else throws error

df['Age'].mean()

29.5

In [213]:
df['Age'].sum()

118

In [214]:
df['Age'].min()

25

In [215]:
df['Age'].max()

35

In [227]:
# Sort the DataFrame by one or more columns

df.sort_values(by='Age')

      Name  Age           City
3    David   28        Chicago
2  Charlie   35    Los Angeles
0    Alice   25       New York
1      Bob   30  San Francisco

In [229]:
df.sort_values(by='Age',ascending = False) # Descending order

      Name  Age           City
2  Charlie   35    Los Angeles
1      Bob   30  San Francisco
3    David   28        Chicago
0    Alice   25       New York

In [233]:
df.sort_index()

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [234]:
df.sort_index(ascending = False)

      Name  Age           City
3    David   28        Chicago
2  Charlie   35    Los Angeles
1      Bob   30  San Francisco
0    Alice   25       New York

In [237]:
# group data based on specific columns for aggregation

df.groupby('Age')

In [239]:
# Handle missing values, drop columns, or rename columns

df.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [241]:
df.notnull()

   Name   Age  City
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True

In [242]:
df.fillna('Age')

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [244]:
df.drop(columns = ['City'])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [250]:
df.rename(columns = {'City':'Place'})

      Name  Age          Place
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [255]:
# Apply a function to each element, row, or column of the DataFrame

def test_func(x):
    return x*10

df['Age'] = df['Age'].apply(test_func)

In [256]:
df.head()

      Name  Age          Place
0    Alice  250       New York
1      Bob  300  San Francisco
2  Charlie  350    Los Angeles
3    David  280        Chicago